[
  {
    "id": 1,
    "name": "Moustafa Dabah",
    "role": "Founder & Lead Engineer",
    "bio": "As an Information Security specialist, I lead a skilled technical team delivering end-to-end solutions across product engineering, web and mobile development, infrastructure, and data systems. We build secure, reliable systems from the ground up and enhance existing platforms for companies of all sizes. Our experience also includes responsibly identifying and reporting real issues to major global platforms such as Google (YouTube), Facebook, Twitter, Carrefour, Quora, and others",
    "experience": [
      "Designed and built end-to-end systems and enterprise-level platforms for startups and large-scale companies",
      "Collaborated with and integrated solutions for major global platforms such as Google/YouTube, Facebook, Twitter, Carrefour, and Quora",
      "Diagnosed and resolved complex real-world technical and business challenges through structured analysis and responsible reporting",
      "Delivered consistent, high-quality work across projects of varying size, scope, and complexity"
    ],
    "expertise": [
      "Architecture",
      "DevOps",
      "Front-end: HTML, CSS, JavaScript, React",
      "Back-end: PHP, .NET",
      "Web & Network Penetration Testing, OWASP Top 10",
      "Team Leadership",
      "System Design"
    ],
    "avatar": "👨‍💻",
    "portfolioLink": "https://ahmedmostafadev.vercel.app/",
    "track": [
      "Led enterprise-level architecture and guided companies through digital transformation",
      "Designed and built full-scale, high-performance platforms for startups and large enterprises",
      "Integrated systems with major global platforms such as Google/YouTube, Facebook, Twitter, Carrefour, and Quora",
      "Provided secure, scalable solutions with strong focus on DevOps, system design, and penetration testing",
      "Solved real-world business and technical challenges through analytical thinking and responsible reporting",
      "Successfully led engineering teams and ensured high-quality delivery across all project sizes"
    ]
  },
  {
    "id": 2,
    "name": "Mohamed Ayman",
    "role": "Full Stack Developer",
    "bio": "Specializing in modern web technologies and creating seamless user experiences across web and mobile platforms. Expert in React, Node.js, and scaling applications.",
    "experience": [
      "Built 20+ production applications",
      "Expert in React, Node.js, and mobile development",
      "Passionate about performance optimization and UX",
      "Contributed to open-source projects"
    ],
    "expertise": ["React", "Node.js", "NestJS", "Angular", "UI/UX"],
    "avatar": "👨‍💻",
    "portfolioLink": "https://www.mohamedayman.dev/",
    "track": [
      "Developed Facelog social media platform",
      "Built Safebites e-commerce solution",
      "Travel booking platform architecture"
    ]
  },
  {
    "id": 3,
    "name": "Ahmed Mostafa",
    "role": "Front End Developer",
    "bio": "Dedicated Front End Developer with a strong commitment to continuous learning. Advanced my skills through the MEARN scholarship at ITI. With over a year of front-end experience, I specialize in building dynamic, responsive, and scalable web applications using MongoDB, Express.js, React, and Node.js. I focus on delivering custom, high-performance solutions with intuitive UI, seamless API integration, optimized code, and ongoing support—all tailored to your project’s needs.",
    "experience": [
      "Built various systems and full-scale platforms for both large and small companies",
      "Worked with major global platforms (Google/YouTube, Facebook, Twitter, Carrefour, Quora)",
      "Identified and helped resolve real-world issues through responsible reporting",
      "High-quality work regardless of project size"
    ],
    "expertise": [
      "Front End Development",
      "React",
      "Next.js",
      "Angular",
      "UI/UX"
    ],
    "avatar": "👨‍💻",
    "portfolioLink": "https://ahmedmostafadev.vercel.app/",
    "track": [
      "Built various systems and full-scale platforms for both large and small companies",
      "Worked with major global platforms (Google/YouTube, Facebook, Twitter, Carrefour, Quora)",
      "Identified and helped resolve real-world issues through responsible reporting"
    ]
  },
  {
    "id": 4,
    "name": "Join Our Team",
    "role": "Future Colleague",
    "bio": "We are always looking for talented individuals to join our high-performance team. If you are passionate about technology and solving real-world problems, we want to hear from you.",
    "experience": [
      "Passionate about code",
      "Eager to learn and grow",
      "Team player",
      "Problem solver"
    ],
    "expertise": ["Your Skills Here"],
    "avatar": "🚀",
    "portfolioLink": "/contact",
    "track": []
  }
]
